app/views/posts/category.html.erb

        <div class="category-container">
          <% post.posts_category.each do |post_category| %>
---
SELECT `categories`.* FROM `categories`
SELECT `posts`.* FROM `posts` INNER JOIN `posts_categories` ON `posts_categories`.`post_id` = `posts`.`id` WHERE `posts_categories`.`category_id` = 18 AND `posts_categories`.`post_id` IN (18, 19, 20, 21, 43, 44, 49, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 45, 46, 47, 48, 52, 53)
SELECT `posts_categories`.* FROM `posts_categories` WHERE `posts_categories`.`post_id` = 18