app/views/posts/index.html.erb

        <div class="category-container">
          <% post.posts_category.each do |post_category| %>
---
SELECT `categories`.* FROM `categories`
SELECT `posts`.* FROM `posts`
SELECT `posts_categories`.* FROM `posts_categories` WHERE `posts_categories`.`post_id` = 18