app/views/posts/show.html.erb

SELECT `posts_categories`.* FROM `posts_categories` WHERE `posts_categories`.`post_id` = 42
---
    <div class="post-footer">
      <% @post.posts_category.each do |post_category|%>