app/controllers/posts_controller.rb

  def index
    @posts = Post.all
    @categories = Category.all
---
SELECT `posts`.`id` FROM `posts`
SELECT `categories`.* FROM `categories`

  def category
    @category_title = Category.find(params[:id]).title
    @posts = Post.joins(:posts_category).where(posts_categories: { category_id: params[:id] })
    @categories = Category.all
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 18 LIMIT 1
SELECT `posts`.* FROM `posts` INNER JOIN `posts_categories` ON `posts_categories`.`post_id` = `posts`.`id` WHERE `posts_categories`.`category_id` = 18 AND `posts_categories`.`post_id` IN (18, 19, 20, 21, 43, 44, 49, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 45, 46, 47, 48, 52, 53)
SELECT `categories`.* FROM `categories`