app/controllers/sessions_controller.rb

  def find_user_by(username)
    user = User.find_by(username: username)
    return user if user

    user = User.find_by(email: username)
---
SELECT `users`.* FROM `users` WHERE `users`.`username` = 'test' LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`email` IS NULL LIMIT 1