app/controllers/users_controller.rb

INSERT INTO `users` (`firstname`, `lastname`, `username`, `email`, `password`, `password_digest`, `avatar`, `created_at`, `updated_at`, `checked`, `is_admin`, `eliminated`) VALUES ('test', 'test', 'test', 'test@test.com', NULL, '$2a$12$nTycYP7BrN88AHoOL5Ta.e8GB2MFtOoUmyeP2sZW59VblmdzzuvVS', NULL, '2024-01-21 03:47:31', '2024-01-21 03:47:31', FALSE, FALSE, FALSE)
---
  def create
    @user = User.new(user_params)

    error = valid_params(@user)

    if !error && @user.save

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'test@test.com' LIMIT 1
---
  def user_exists?(user)
    User.find_by(username: user.username) || User.find_by(email: user.email)