app/models/user.rb

  def set_defaults_preferences
    preferences.create(color: '#000000', theme: 'light')
---
INSERT INTO `preferences` (`user_id`, `theme`, `color`) VALUES (94, 'light', '#000000')